ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_cpuss.h
/***************************************************************************//**
* \file cyip_cpuss.h
*
* \brief
* CPUSS IP definitions
*
* \note
* Generated 2/9/2017 by CyDeviceHeaderGenerator v1.1.0.47
* from the register map configuration rev#961378
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef _CYIP_CPUSS_H_
#define _CYIP_CPUSS_H_

#include "cyip_headers.h"

/* =========================================================================================================================== */
/* ================                                           CPUSS                                           ================ */
/* =========================================================================================================================== */

#define CPUSS_SECTION_SIZE          0x00010000UL

/**
  * \brief CPU subsystem (CPUSS) (CPUSS)
  */
typedef struct {                                /*!< CPUSS Structure                                                           */
  __IOM uint32_t CM0_CTL;                       /*!< 0x00000000 CM0+ control                                                   */
   __IM uint32_t RESERVED;
   __IM uint32_t CM0_STATUS;                    /*!< 0x00000008 CM0+ status                                                    */
   __IM uint32_t RESERVED1;
  __IOM uint32_t CM0_CLOCK_CTL;                 /*!< 0x00000010 CM0+ clock control                                             */
   __IM uint32_t RESERVED2[2];
  __IOM uint32_t CM0_NMI_CTL;                   /*!< 0x0000001C CM0+ NMI control                                               */
  __IOM uint32_t CM0_INT_CTL0;                  /*!< 0x00000020 CM0+ interrupt control 0                                       */
  __IOM uint32_t CM0_INT_CTL1;                  /*!< 0x00000024 CM0+ interrupt control 1                                       */
  __IOM uint32_t CM0_INT_CTL2;                  /*!< 0x00000028 CM0+ interrupt control 2                                       */
  __IOM uint32_t CM0_INT_CTL3;                  /*!< 0x0000002C CM0+ interrupt control 3                                       */
  __IOM uint32_t CM0_INT_CTL4;                  /*!< 0x00000030 CM0+ interrupt control 4                                       */
  __IOM uint32_t CM0_INT_CTL5;                  /*!< 0x00000034 CM0+ interrupt control 5                                       */
  __IOM uint32_t CM0_INT_CTL6;                  /*!< 0x00000038 CM0+ interrupt control 6                                       */
  __IOM uint32_t CM0_INT_CTL7;                  /*!< 0x0000003C CM0+ interrupt control 7                                       */
   __IM uint32_t RESERVED3[16];
  __IOM uint32_t CM4_PWR_CTL;                   /*!< 0x00000080 CM4 power control                                              */
   __IM uint32_t RESERVED4;
   __IM uint32_t CM4_STATUS;                    /*!< 0x00000088 CM4 status                                                     */
   __IM uint32_t RESERVED5;
  __IOM uint32_t CM4_CLOCK_CTL;                 /*!< 0x00000090 CM4 clock control                                              */
   __IM uint32_t RESERVED6[3];
  __IOM uint32_t CM4_NMI_CTL;                   /*!< 0x000000A0 CM4 NMI control                                                */
   __IM uint32_t RESERVED7[7];
  __IOM uint32_t UDB_PWR_CTL;                   /*!< 0x000000C0 UDB power control                                              */
   __IM uint32_t RESERVED8[15];
  __IOM uint32_t RAM0_CTL0;                     /*!< 0x00000100 RAM 0 control 0                                                */
   __IM uint32_t RESERVED9[15];
  __IOM uint32_t RAM0_PWR_MACRO_CTL[16];        /*!< 0x00000140 RAM 0 power control                                            */
  __IOM uint32_t RAM1_CTL0;                     /*!< 0x00000180 RAM 1 control 0                                                */
   __IM uint32_t RESERVED10[3];
  __IOM uint32_t RAM1_PWR_CTL;                  /*!< 0x00000190 RAM1 power control                                             */
   __IM uint32_t RESERVED11[3];
  __IOM uint32_t RAM2_CTL0;                     /*!< 0x000001A0 RAM 2 control 0                                                */
   __IM uint32_t RESERVED12[3];
  __IOM uint32_t RAM2_PWR_CTL;                  /*!< 0x000001B0 RAM2 power control                                             */
   __IM uint32_t RESERVED13[3];
  __IOM uint32_t ROM_CTL;                       /*!< 0x000001C0 ROM control                                                    */
   __IM uint32_t RESERVED14[7];
  __IOM uint32_t ETB_PWR_CTL;                   /*!< 0x000001E0 ETB power control                                              */
   __IM uint32_t RESERVED15[9];
   __IM uint32_t DP_STATUS;                     /*!< 0x00000208 Debug port status                                              */
   __IM uint32_t RESERVED16[5];
  __IOM uint32_t BUFF_CTL;                      /*!< 0x00000220 Buffer control                                                 */
   __IM uint32_t RESERVED17[7];
  __IOM uint32_t SYSTICK_CTL;                   /*!< 0x00000240 SysTick timer control                                          */
   __IM uint32_t RESERVED18[12];
   __IM uint32_t MBIST_STAT;                    /*!< 0x00000274 Memory BIST status                                             */
   __IM uint32_t RESERVED19[2];
  __IOM uint32_t WOUNDING;                      /*!< 0x00000280 Wounding                                                       */
   __IM uint32_t RESERVED20[3];
  __IOM uint32_t PROTECTION;                    /*!< 0x00000290 Protection status                                              */
   __IM uint32_t RESERVED21[3];
  __IOM uint32_t CM0_PC0_HANDLER;               /*!< 0x000002A0 CM0+ protection context 0 handler                              */
   __IM uint32_t RESERVED22[3];
  __IOM uint32_t CM0_VECTOR_TABLE_BASE;         /*!< 0x000002B0 CM0+ vector table base                                         */
   __IM uint32_t RESERVED23[3];
  __IOM uint32_t CM4_VECTOR_TABLE_BASE;         /*!< 0x000002C0 CM4 vector table base                                          */
   __IM uint32_t RESERVED24[79];
   __IM uint32_t IDENTITY;                      /*!< 0x00000400 Identity                                                       */
   __IM uint32_t RESERVED25[15103];
  __IOM uint32_t TRIM_ROM_CTL;                  /*!< 0x0000F000 ROM trim control                                               */
  __IOM uint32_t TRIM_RAM_CTL;                  /*!< 0x0000F004 RAM trim control                                               */
} CPUSS_Type;                                   /*!< Size = 61448 (0xF008)                                                     */


