ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_cpuss.h
/* =====================================================  CPUSS.CM0_CTL  ===================================================== */
#define CPUSS_CM0_CTL_SLV_STALL_Pos       (28UL)                /*!< CPUSS CM0_CTL: SLV_STALL (Bit 28)                         */
#define CPUSS_CM0_CTL_SLV_STALL_Msk       (0x10000000UL)        /*!< CPUSS CM0_CTL: SLV_STALL (Bitfield-Mask: 0x01)            */
#define CPUSS_CM0_CTL_ENABLED_Pos         (31UL)                /*!< CPUSS CM0_CTL: ENABLED (Bit 31)                           */
#define CPUSS_CM0_CTL_ENABLED_Msk         (0x80000000UL)        /*!< CPUSS CM0_CTL: ENABLED (Bitfield-Mask: 0x01)              */
/* ===================================================  CPUSS.CM0_STATUS  ==================================================== */
#define CPUSS_CM0_STATUS_SLEEPING_Pos     (0UL)                 /*!< CPUSS CM0_STATUS: SLEEPING (Bit 0)                        */
#define CPUSS_CM0_STATUS_SLEEPING_Msk     (0x1UL)               /*!< CPUSS CM0_STATUS: SLEEPING (Bitfield-Mask: 0x01)          */
#define CPUSS_CM0_STATUS_SLEEPDEEP_Pos    (1UL)                 /*!< CPUSS CM0_STATUS: SLEEPDEEP (Bit 1)                       */
#define CPUSS_CM0_STATUS_SLEEPDEEP_Msk    (0x2UL)               /*!< CPUSS CM0_STATUS: SLEEPDEEP (Bitfield-Mask: 0x01)         */
/* ==================================================  CPUSS.CM0_CLOCK_CTL  ================================================== */
#define CPUSS_CM0_CLOCK_CTL_SLOW_INT_DIV_Pos (8UL)              /*!< CPUSS CM0_CLOCK_CTL: SLOW_INT_DIV (Bit 8)                 */
#define CPUSS_CM0_CLOCK_CTL_SLOW_INT_DIV_Msk (0xff00UL)         /*!< CPUSS CM0_CLOCK_CTL: SLOW_INT_DIV (Bitfield-Mask: 0xff)   */
#define CPUSS_CM0_CLOCK_CTL_PERI_INT_DIV_Pos (24UL)             /*!< CPUSS CM0_CLOCK_CTL: PERI_INT_DIV (Bit 24)                */
#define CPUSS_CM0_CLOCK_CTL_PERI_INT_DIV_Msk (0xff000000UL)     /*!< CPUSS CM0_CLOCK_CTL: PERI_INT_DIV (Bitfield-Mask: 0xff)   */
/* ===================================================  CPUSS.CM0_NMI_CTL  =================================================== */
#define CPUSS_CM0_NMI_CTL_MUX0_SEL_Pos    (0UL)                 /*!< CPUSS CM0_NMI_CTL: MUX0_SEL (Bit 0)                       */
#define CPUSS_CM0_NMI_CTL_MUX0_SEL_Msk    (0xffUL)              /*!< CPUSS CM0_NMI_CTL: MUX0_SEL (Bitfield-Mask: 0xff)         */
/* ==================================================  CPUSS.CM0_INT_CTL0  =================================================== */
#define CPUSS_CM0_INT_CTL0_MUX0_SEL_Pos   (0UL)                 /*!< CPUSS CM0_INT_CTL0: MUX0_SEL (Bit 0)                      */
#define CPUSS_CM0_INT_CTL0_MUX0_SEL_Msk   (0xffUL)              /*!< CPUSS CM0_INT_CTL0: MUX0_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL0_MUX1_SEL_Pos   (8UL)                 /*!< CPUSS CM0_INT_CTL0: MUX1_SEL (Bit 8)                      */
#define CPUSS_CM0_INT_CTL0_MUX1_SEL_Msk   (0xff00UL)            /*!< CPUSS CM0_INT_CTL0: MUX1_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL0_MUX2_SEL_Pos   (16UL)                /*!< CPUSS CM0_INT_CTL0: MUX2_SEL (Bit 16)                     */
#define CPUSS_CM0_INT_CTL0_MUX2_SEL_Msk   (0xff0000UL)          /*!< CPUSS CM0_INT_CTL0: MUX2_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL0_MUX3_SEL_Pos   (24UL)                /*!< CPUSS CM0_INT_CTL0: MUX3_SEL (Bit 24)                     */
#define CPUSS_CM0_INT_CTL0_MUX3_SEL_Msk   (0xff000000UL)        /*!< CPUSS CM0_INT_CTL0: MUX3_SEL (Bitfield-Mask: 0xff)        */
/* ==================================================  CPUSS.CM0_INT_CTL1  =================================================== */
#define CPUSS_CM0_INT_CTL1_MUX0_SEL_Pos   (0UL)                 /*!< CPUSS CM0_INT_CTL1: MUX0_SEL (Bit 0)                      */
#define CPUSS_CM0_INT_CTL1_MUX0_SEL_Msk   (0xffUL)              /*!< CPUSS CM0_INT_CTL1: MUX0_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL1_MUX1_SEL_Pos   (8UL)                 /*!< CPUSS CM0_INT_CTL1: MUX1_SEL (Bit 8)                      */
#define CPUSS_CM0_INT_CTL1_MUX1_SEL_Msk   (0xff00UL)            /*!< CPUSS CM0_INT_CTL1: MUX1_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL1_MUX2_SEL_Pos   (16UL)                /*!< CPUSS CM0_INT_CTL1: MUX2_SEL (Bit 16)                     */
#define CPUSS_CM0_INT_CTL1_MUX2_SEL_Msk   (0xff0000UL)          /*!< CPUSS CM0_INT_CTL1: MUX2_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL1_MUX3_SEL_Pos   (24UL)                /*!< CPUSS CM0_INT_CTL1: MUX3_SEL (Bit 24)                     */
#define CPUSS_CM0_INT_CTL1_MUX3_SEL_Msk   (0xff000000UL)        /*!< CPUSS CM0_INT_CTL1: MUX3_SEL (Bitfield-Mask: 0xff)        */
/* ==================================================  CPUSS.CM0_INT_CTL2  =================================================== */
#define CPUSS_CM0_INT_CTL2_MUX0_SEL_Pos   (0UL)                 /*!< CPUSS CM0_INT_CTL2: MUX0_SEL (Bit 0)                      */
#define CPUSS_CM0_INT_CTL2_MUX0_SEL_Msk   (0xffUL)              /*!< CPUSS CM0_INT_CTL2: MUX0_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL2_MUX1_SEL_Pos   (8UL)                 /*!< CPUSS CM0_INT_CTL2: MUX1_SEL (Bit 8)                      */
#define CPUSS_CM0_INT_CTL2_MUX1_SEL_Msk   (0xff00UL)            /*!< CPUSS CM0_INT_CTL2: MUX1_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL2_MUX2_SEL_Pos   (16UL)                /*!< CPUSS CM0_INT_CTL2: MUX2_SEL (Bit 16)                     */
#define CPUSS_CM0_INT_CTL2_MUX2_SEL_Msk   (0xff0000UL)          /*!< CPUSS CM0_INT_CTL2: MUX2_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL2_MUX3_SEL_Pos   (24UL)                /*!< CPUSS CM0_INT_CTL2: MUX3_SEL (Bit 24)                     */
#define CPUSS_CM0_INT_CTL2_MUX3_SEL_Msk   (0xff000000UL)        /*!< CPUSS CM0_INT_CTL2: MUX3_SEL (Bitfield-Mask: 0xff)        */
/* ==================================================  CPUSS.CM0_INT_CTL3  =================================================== */
#define CPUSS_CM0_INT_CTL3_MUX0_SEL_Pos   (0UL)                 /*!< CPUSS CM0_INT_CTL3: MUX0_SEL (Bit 0)                      */
#define CPUSS_CM0_INT_CTL3_MUX0_SEL_Msk   (0xffUL)              /*!< CPUSS CM0_INT_CTL3: MUX0_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL3_MUX1_SEL_Pos   (8UL)                 /*!< CPUSS CM0_INT_CTL3: MUX1_SEL (Bit 8)                      */
#define CPUSS_CM0_INT_CTL3_MUX1_SEL_Msk   (0xff00UL)            /*!< CPUSS CM0_INT_CTL3: MUX1_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL3_MUX2_SEL_Pos   (16UL)                /*!< CPUSS CM0_INT_CTL3: MUX2_SEL (Bit 16)                     */
#define CPUSS_CM0_INT_CTL3_MUX2_SEL_Msk   (0xff0000UL)          /*!< CPUSS CM0_INT_CTL3: MUX2_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL3_MUX3_SEL_Pos   (24UL)                /*!< CPUSS CM0_INT_CTL3: MUX3_SEL (Bit 24)                     */
#define CPUSS_CM0_INT_CTL3_MUX3_SEL_Msk   (0xff000000UL)        /*!< CPUSS CM0_INT_CTL3: MUX3_SEL (Bitfield-Mask: 0xff)        */
/* ==================================================  CPUSS.CM0_INT_CTL4  =================================================== */
#define CPUSS_CM0_INT_CTL4_MUX0_SEL_Pos   (0UL)                 /*!< CPUSS CM0_INT_CTL4: MUX0_SEL (Bit 0)                      */
#define CPUSS_CM0_INT_CTL4_MUX0_SEL_Msk   (0xffUL)              /*!< CPUSS CM0_INT_CTL4: MUX0_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL4_MUX1_SEL_Pos   (8UL)                 /*!< CPUSS CM0_INT_CTL4: MUX1_SEL (Bit 8)                      */
#define CPUSS_CM0_INT_CTL4_MUX1_SEL_Msk   (0xff00UL)            /*!< CPUSS CM0_INT_CTL4: MUX1_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL4_MUX2_SEL_Pos   (16UL)                /*!< CPUSS CM0_INT_CTL4: MUX2_SEL (Bit 16)                     */
#define CPUSS_CM0_INT_CTL4_MUX2_SEL_Msk   (0xff0000UL)          /*!< CPUSS CM0_INT_CTL4: MUX2_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL4_MUX3_SEL_Pos   (24UL)                /*!< CPUSS CM0_INT_CTL4: MUX3_SEL (Bit 24)                     */
#define CPUSS_CM0_INT_CTL4_MUX3_SEL_Msk   (0xff000000UL)        /*!< CPUSS CM0_INT_CTL4: MUX3_SEL (Bitfield-Mask: 0xff)        */
/* ==================================================  CPUSS.CM0_INT_CTL5  =================================================== */
#define CPUSS_CM0_INT_CTL5_MUX0_SEL_Pos   (0UL)                 /*!< CPUSS CM0_INT_CTL5: MUX0_SEL (Bit 0)                      */
#define CPUSS_CM0_INT_CTL5_MUX0_SEL_Msk   (0xffUL)              /*!< CPUSS CM0_INT_CTL5: MUX0_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL5_MUX1_SEL_Pos   (8UL)                 /*!< CPUSS CM0_INT_CTL5: MUX1_SEL (Bit 8)                      */
#define CPUSS_CM0_INT_CTL5_MUX1_SEL_Msk   (0xff00UL)            /*!< CPUSS CM0_INT_CTL5: MUX1_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL5_MUX2_SEL_Pos   (16UL)                /*!< CPUSS CM0_INT_CTL5: MUX2_SEL (Bit 16)                     */
#define CPUSS_CM0_INT_CTL5_MUX2_SEL_Msk   (0xff0000UL)          /*!< CPUSS CM0_INT_CTL5: MUX2_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL5_MUX3_SEL_Pos   (24UL)                /*!< CPUSS CM0_INT_CTL5: MUX3_SEL (Bit 24)                     */
#define CPUSS_CM0_INT_CTL5_MUX3_SEL_Msk   (0xff000000UL)        /*!< CPUSS CM0_INT_CTL5: MUX3_SEL (Bitfield-Mask: 0xff)        */
/* ==================================================  CPUSS.CM0_INT_CTL6  =================================================== */
#define CPUSS_CM0_INT_CTL6_MUX0_SEL_Pos   (0UL)                 /*!< CPUSS CM0_INT_CTL6: MUX0_SEL (Bit 0)                      */
#define CPUSS_CM0_INT_CTL6_MUX0_SEL_Msk   (0xffUL)              /*!< CPUSS CM0_INT_CTL6: MUX0_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL6_MUX1_SEL_Pos   (8UL)                 /*!< CPUSS CM0_INT_CTL6: MUX1_SEL (Bit 8)                      */
#define CPUSS_CM0_INT_CTL6_MUX1_SEL_Msk   (0xff00UL)            /*!< CPUSS CM0_INT_CTL6: MUX1_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL6_MUX2_SEL_Pos   (16UL)                /*!< CPUSS CM0_INT_CTL6: MUX2_SEL (Bit 16)                     */
#define CPUSS_CM0_INT_CTL6_MUX2_SEL_Msk   (0xff0000UL)          /*!< CPUSS CM0_INT_CTL6: MUX2_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL6_MUX3_SEL_Pos   (24UL)                /*!< CPUSS CM0_INT_CTL6: MUX3_SEL (Bit 24)                     */
#define CPUSS_CM0_INT_CTL6_MUX3_SEL_Msk   (0xff000000UL)        /*!< CPUSS CM0_INT_CTL6: MUX3_SEL (Bitfield-Mask: 0xff)        */
/* ==================================================  CPUSS.CM0_INT_CTL7  =================================================== */
#define CPUSS_CM0_INT_CTL7_MUX0_SEL_Pos   (0UL)                 /*!< CPUSS CM0_INT_CTL7: MUX0_SEL (Bit 0)                      */
#define CPUSS_CM0_INT_CTL7_MUX0_SEL_Msk   (0xffUL)              /*!< CPUSS CM0_INT_CTL7: MUX0_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL7_MUX1_SEL_Pos   (8UL)                 /*!< CPUSS CM0_INT_CTL7: MUX1_SEL (Bit 8)                      */
#define CPUSS_CM0_INT_CTL7_MUX1_SEL_Msk   (0xff00UL)            /*!< CPUSS CM0_INT_CTL7: MUX1_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL7_MUX2_SEL_Pos   (16UL)                /*!< CPUSS CM0_INT_CTL7: MUX2_SEL (Bit 16)                     */
#define CPUSS_CM0_INT_CTL7_MUX2_SEL_Msk   (0xff0000UL)          /*!< CPUSS CM0_INT_CTL7: MUX2_SEL (Bitfield-Mask: 0xff)        */
#define CPUSS_CM0_INT_CTL7_MUX3_SEL_Pos   (24UL)                /*!< CPUSS CM0_INT_CTL7: MUX3_SEL (Bit 24)                     */
#define CPUSS_CM0_INT_CTL7_MUX3_SEL_Msk   (0xff000000UL)        /*!< CPUSS CM0_INT_CTL7: MUX3_SEL (Bitfield-Mask: 0xff)        */
/* ===================================================  CPUSS.CM4_PWR_CTL  =================================================== */
#define CPUSS_CM4_PWR_CTL_ISOLATE_Pos     (0UL)                 /*!< CPUSS CM4_PWR_CTL: ISOLATE (Bit 0)                        */
#define CPUSS_CM4_PWR_CTL_ISOLATE_Msk     (0x1UL)               /*!< CPUSS CM4_PWR_CTL: ISOLATE (Bitfield-Mask: 0x01)          */
#define CPUSS_CM4_PWR_CTL_RETAIN_Pos      (1UL)                 /*!< CPUSS CM4_PWR_CTL: RETAIN (Bit 1)                         */
#define CPUSS_CM4_PWR_CTL_RETAIN_Msk      (0x2UL)               /*!< CPUSS CM4_PWR_CTL: RETAIN (Bitfield-Mask: 0x01)           */
#define CPUSS_CM4_PWR_CTL_POWER_Pos       (2UL)                 /*!< CPUSS CM4_PWR_CTL: POWER (Bit 2)                          */
#define CPUSS_CM4_PWR_CTL_POWER_Msk       (0x4UL)               /*!< CPUSS CM4_PWR_CTL: POWER (Bitfield-Mask: 0x01)            */
#define CPUSS_CM4_PWR_CTL_RESET_Pos       (3UL)                 /*!< CPUSS CM4_PWR_CTL: RESET (Bit 3)                          */
#define CPUSS_CM4_PWR_CTL_RESET_Msk       (0x8UL)               /*!< CPUSS CM4_PWR_CTL: RESET (Bitfield-Mask: 0x01)            */
#define CPUSS_CM4_PWR_CTL_CLOCK_Pos       (4UL)                 /*!< CPUSS CM4_PWR_CTL: CLOCK (Bit 4)                          */
#define CPUSS_CM4_PWR_CTL_CLOCK_Msk       (0x10UL)              /*!< CPUSS CM4_PWR_CTL: CLOCK (Bitfield-Mask: 0x01)            */
/* ===================================================  CPUSS.CM4_STATUS  ==================================================== */
#define CPUSS_CM4_STATUS_SLEEPING_Pos     (0UL)                 /*!< CPUSS CM4_STATUS: SLEEPING (Bit 0)                        */
#define CPUSS_CM4_STATUS_SLEEPING_Msk     (0x1UL)               /*!< CPUSS CM4_STATUS: SLEEPING (Bitfield-Mask: 0x01)          */
#define CPUSS_CM4_STATUS_SLEEPDEEP_Pos    (1UL)                 /*!< CPUSS CM4_STATUS: SLEEPDEEP (Bit 1)                       */
#define CPUSS_CM4_STATUS_SLEEPDEEP_Msk    (0x2UL)               /*!< CPUSS CM4_STATUS: SLEEPDEEP (Bitfield-Mask: 0x01)         */
/* ==================================================  CPUSS.CM4_CLOCK_CTL  ================================================== */
#define CPUSS_CM4_CLOCK_CTL_FAST_INT_DIV_Pos (8UL)              /*!< CPUSS CM4_CLOCK_CTL: FAST_INT_DIV (Bit 8)                 */
#define CPUSS_CM4_CLOCK_CTL_FAST_INT_DIV_Msk (0xff00UL)         /*!< CPUSS CM4_CLOCK_CTL: FAST_INT_DIV (Bitfield-Mask: 0xff)   */
/* ===================================================  CPUSS.CM4_NMI_CTL  =================================================== */
#define CPUSS_CM4_NMI_CTL_MUX0_SEL_Pos    (0UL)                 /*!< CPUSS CM4_NMI_CTL: MUX0_SEL (Bit 0)                       */
#define CPUSS_CM4_NMI_CTL_MUX0_SEL_Msk    (0xffUL)              /*!< CPUSS CM4_NMI_CTL: MUX0_SEL (Bitfield-Mask: 0xff)         */
/* ===================================================  CPUSS.UDB_PWR_CTL  =================================================== */
#define CPUSS_UDB_PWR_CTL_ISOLATE_Pos     (0UL)                 /*!< CPUSS UDB_PWR_CTL: ISOLATE (Bit 0)                        */
#define CPUSS_UDB_PWR_CTL_ISOLATE_Msk     (0x1UL)               /*!< CPUSS UDB_PWR_CTL: ISOLATE (Bitfield-Mask: 0x01)          */
#define CPUSS_UDB_PWR_CTL_RETAIN_Pos      (1UL)                 /*!< CPUSS UDB_PWR_CTL: RETAIN (Bit 1)                         */
#define CPUSS_UDB_PWR_CTL_RETAIN_Msk      (0x2UL)               /*!< CPUSS UDB_PWR_CTL: RETAIN (Bitfield-Mask: 0x01)           */
#define CPUSS_UDB_PWR_CTL_POWER_Pos       (2UL)                 /*!< CPUSS UDB_PWR_CTL: POWER (Bit 2)                          */
#define CPUSS_UDB_PWR_CTL_POWER_Msk       (0x4UL)               /*!< CPUSS UDB_PWR_CTL: POWER (Bitfield-Mask: 0x01)            */
#define CPUSS_UDB_PWR_CTL_RESET_Pos       (3UL)                 /*!< CPUSS UDB_PWR_CTL: RESET (Bit 3)                          */
#define CPUSS_UDB_PWR_CTL_RESET_Msk       (0x8UL)               /*!< CPUSS UDB_PWR_CTL: RESET (Bitfield-Mask: 0x01)            */
#define CPUSS_UDB_PWR_CTL_CLOCK_Pos       (4UL)                 /*!< CPUSS UDB_PWR_CTL: CLOCK (Bit 4)                          */
#define CPUSS_UDB_PWR_CTL_CLOCK_Msk       (0x10UL)              /*!< CPUSS UDB_PWR_CTL: CLOCK (Bitfield-Mask: 0x01)            */
/* ====================================================  CPUSS.RAM0_CTL0  ==================================================== */
#define CPUSS_RAM0_CTL0_SLOW_WS_Pos       (0UL)                 /*!< CPUSS RAM0_CTL0: SLOW_WS (Bit 0)                          */
#define CPUSS_RAM0_CTL0_SLOW_WS_Msk       (0x3UL)               /*!< CPUSS RAM0_CTL0: SLOW_WS (Bitfield-Mask: 0x03)            */
#define CPUSS_RAM0_CTL0_FAST_WS_Pos       (8UL)                 /*!< CPUSS RAM0_CTL0: FAST_WS (Bit 8)                          */
#define CPUSS_RAM0_CTL0_FAST_WS_Msk       (0x300UL)             /*!< CPUSS RAM0_CTL0: FAST_WS (Bitfield-Mask: 0x03)            */
/* ===============================================  CPUSS.RAM0_PWR_MACRO_CTL  ================================================ */
#define CPUSS_RAM0_PWR_MACRO_CTL_ISOLATE_Pos (0UL)              /*!< CPUSS RAM0_PWR_MACRO_CTL: ISOLATE (Bit 0)                 */
#define CPUSS_RAM0_PWR_MACRO_CTL_ISOLATE_Msk (0x1UL)            /*!< CPUSS RAM0_PWR_MACRO_CTL: ISOLATE (Bitfield-Mask: 0x01)   */
#define CPUSS_RAM0_PWR_MACRO_CTL_RETAIN_Pos (1UL)               /*!< CPUSS RAM0_PWR_MACRO_CTL: RETAIN (Bit 1)                  */
#define CPUSS_RAM0_PWR_MACRO_CTL_RETAIN_Msk (0x2UL)             /*!< CPUSS RAM0_PWR_MACRO_CTL: RETAIN (Bitfield-Mask: 0x01)    */
#define CPUSS_RAM0_PWR_MACRO_CTL_POWER_Pos (2UL)                /*!< CPUSS RAM0_PWR_MACRO_CTL: POWER (Bit 2)                   */
#define CPUSS_RAM0_PWR_MACRO_CTL_POWER_Msk (0x4UL)              /*!< CPUSS RAM0_PWR_MACRO_CTL: POWER (Bitfield-Mask: 0x01)     */
/* ====================================================  CPUSS.RAM1_CTL0  ==================================================== */
#define CPUSS_RAM1_CTL0_SLOW_WS_Pos       (0UL)                 /*!< CPUSS RAM1_CTL0: SLOW_WS (Bit 0)                          */
#define CPUSS_RAM1_CTL0_SLOW_WS_Msk       (0x3UL)               /*!< CPUSS RAM1_CTL0: SLOW_WS (Bitfield-Mask: 0x03)            */
#define CPUSS_RAM1_CTL0_FAST_WS_Pos       (8UL)                 /*!< CPUSS RAM1_CTL0: FAST_WS (Bit 8)                          */
#define CPUSS_RAM1_CTL0_FAST_WS_Msk       (0x300UL)             /*!< CPUSS RAM1_CTL0: FAST_WS (Bitfield-Mask: 0x03)            */
/* ==================================================  CPUSS.RAM1_PWR_CTL  =================================================== */
#define CPUSS_RAM1_PWR_CTL_ISOLATE_Pos    (0UL)                 /*!< CPUSS RAM1_PWR_CTL: ISOLATE (Bit 0)                       */
#define CPUSS_RAM1_PWR_CTL_ISOLATE_Msk    (0x1UL)               /*!< CPUSS RAM1_PWR_CTL: ISOLATE (Bitfield-Mask: 0x01)         */
#define CPUSS_RAM1_PWR_CTL_RETAIN_Pos     (1UL)                 /*!< CPUSS RAM1_PWR_CTL: RETAIN (Bit 1)                        */
#define CPUSS_RAM1_PWR_CTL_RETAIN_Msk     (0x2UL)               /*!< CPUSS RAM1_PWR_CTL: RETAIN (Bitfield-Mask: 0x01)          */
#define CPUSS_RAM1_PWR_CTL_POWER_Pos      (2UL)                 /*!< CPUSS RAM1_PWR_CTL: POWER (Bit 2)                         */
#define CPUSS_RAM1_PWR_CTL_POWER_Msk      (0x4UL)               /*!< CPUSS RAM1_PWR_CTL: POWER (Bitfield-Mask: 0x01)           */
/* ====================================================  CPUSS.RAM2_CTL0  ==================================================== */
#define CPUSS_RAM2_CTL0_SLOW_WS_Pos       (0UL)                 /*!< CPUSS RAM2_CTL0: SLOW_WS (Bit 0)                          */
#define CPUSS_RAM2_CTL0_SLOW_WS_Msk       (0x3UL)               /*!< CPUSS RAM2_CTL0: SLOW_WS (Bitfield-Mask: 0x03)            */
#define CPUSS_RAM2_CTL0_FAST_WS_Pos       (8UL)                 /*!< CPUSS RAM2_CTL0: FAST_WS (Bit 8)                          */
#define CPUSS_RAM2_CTL0_FAST_WS_Msk       (0x300UL)             /*!< CPUSS RAM2_CTL0: FAST_WS (Bitfield-Mask: 0x03)            */
/* ==================================================  CPUSS.RAM2_PWR_CTL  =================================================== */
#define CPUSS_RAM2_PWR_CTL_ISOLATE_Pos    (0UL)                 /*!< CPUSS RAM2_PWR_CTL: ISOLATE (Bit 0)                       */
#define CPUSS_RAM2_PWR_CTL_ISOLATE_Msk    (0x1UL)               /*!< CPUSS RAM2_PWR_CTL: ISOLATE (Bitfield-Mask: 0x01)         */
#define CPUSS_RAM2_PWR_CTL_RETAIN_Pos     (1UL)                 /*!< CPUSS RAM2_PWR_CTL: RETAIN (Bit 1)                        */
#define CPUSS_RAM2_PWR_CTL_RETAIN_Msk     (0x2UL)               /*!< CPUSS RAM2_PWR_CTL: RETAIN (Bitfield-Mask: 0x01)          */
#define CPUSS_RAM2_PWR_CTL_POWER_Pos      (2UL)                 /*!< CPUSS RAM2_PWR_CTL: POWER (Bit 2)                         */
#define CPUSS_RAM2_PWR_CTL_POWER_Msk      (0x4UL)               /*!< CPUSS RAM2_PWR_CTL: POWER (Bitfield-Mask: 0x01)           */
/* =====================================================  CPUSS.ROM_CTL  ===================================================== */
#define CPUSS_ROM_CTL_SLOW_WS_Pos         (0UL)                 /*!< CPUSS ROM_CTL: SLOW_WS (Bit 0)                            */
#define CPUSS_ROM_CTL_SLOW_WS_Msk         (0x3UL)               /*!< CPUSS ROM_CTL: SLOW_WS (Bitfield-Mask: 0x03)              */
#define CPUSS_ROM_CTL_FAST_WS_Pos         (8UL)                 /*!< CPUSS ROM_CTL: FAST_WS (Bit 8)                            */
#define CPUSS_ROM_CTL_FAST_WS_Msk         (0x300UL)             /*!< CPUSS ROM_CTL: FAST_WS (Bitfield-Mask: 0x03)              */
/* ===================================================  CPUSS.ETB_PWR_CTL  =================================================== */
#define CPUSS_ETB_PWR_CTL_ISOLATE_Pos     (0UL)                 /*!< CPUSS ETB_PWR_CTL: ISOLATE (Bit 0)                        */
#define CPUSS_ETB_PWR_CTL_ISOLATE_Msk     (0x1UL)               /*!< CPUSS ETB_PWR_CTL: ISOLATE (Bitfield-Mask: 0x01)          */
#define CPUSS_ETB_PWR_CTL_RETAIN_Pos      (1UL)                 /*!< CPUSS ETB_PWR_CTL: RETAIN (Bit 1)                         */
#define CPUSS_ETB_PWR_CTL_RETAIN_Msk      (0x2UL)               /*!< CPUSS ETB_PWR_CTL: RETAIN (Bitfield-Mask: 0x01)           */
#define CPUSS_ETB_PWR_CTL_POWER_Pos       (2UL)                 /*!< CPUSS ETB_PWR_CTL: POWER (Bit 2)                          */
#define CPUSS_ETB_PWR_CTL_POWER_Msk       (0x4UL)               /*!< CPUSS ETB_PWR_CTL: POWER (Bitfield-Mask: 0x01)            */
/* ====================================================  CPUSS.DP_STATUS  ==================================================== */
#define CPUSS_DP_STATUS_SWJ_CONNECTED_Pos (0UL)                 /*!< CPUSS DP_STATUS: SWJ_CONNECTED (Bit 0)                    */
#define CPUSS_DP_STATUS_SWJ_CONNECTED_Msk (0x1UL)               /*!< CPUSS DP_STATUS: SWJ_CONNECTED (Bitfield-Mask: 0x01)      */
#define CPUSS_DP_STATUS_SWJ_DEBUG_EN_Pos  (1UL)                 /*!< CPUSS DP_STATUS: SWJ_DEBUG_EN (Bit 1)                     */
#define CPUSS_DP_STATUS_SWJ_DEBUG_EN_Msk  (0x2UL)               /*!< CPUSS DP_STATUS: SWJ_DEBUG_EN (Bitfield-Mask: 0x01)       */
#define CPUSS_DP_STATUS_SWJ_JTAG_SEL_Pos  (2UL)                 /*!< CPUSS DP_STATUS: SWJ_JTAG_SEL (Bit 2)                     */
#define CPUSS_DP_STATUS_SWJ_JTAG_SEL_Msk  (0x4UL)               /*!< CPUSS DP_STATUS: SWJ_JTAG_SEL (Bitfield-Mask: 0x01)       */
/* ====================================================  CPUSS.BUFF_CTL  ===================================================== */
#define CPUSS_BUFF_CTL_WRITE_BUFF_Pos     (0UL)                 /*!< CPUSS BUFF_CTL: WRITE_BUFF (Bit 0)                        */
#define CPUSS_BUFF_CTL_WRITE_BUFF_Msk     (0x1UL)               /*!< CPUSS BUFF_CTL: WRITE_BUFF (Bitfield-Mask: 0x01)          */
/* ===================================================  CPUSS.SYSTICK_CTL  =================================================== */
#define CPUSS_SYSTICK_CTL_TENMS_Pos       (0UL)                 /*!< CPUSS SYSTICK_CTL: TENMS (Bit 0)                          */
#define CPUSS_SYSTICK_CTL_TENMS_Msk       (0xffffffUL)          /*!< CPUSS SYSTICK_CTL: TENMS (Bitfield-Mask: 0xffffff)        */
