ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_cpuss.h
#define CPUSS_SYSTICK_CTL_CLOCK_SOURCE_Pos (24UL)               /*!< CPUSS SYSTICK_CTL: CLOCK_SOURCE (Bit 24)                  */
#define CPUSS_SYSTICK_CTL_CLOCK_SOURCE_Msk (0x3000000UL)        /*!< CPUSS SYSTICK_CTL: CLOCK_SOURCE (Bitfield-Mask: 0x03)     */
#define CPUSS_SYSTICK_CTL_SKEW_Pos        (30UL)                /*!< CPUSS SYSTICK_CTL: SKEW (Bit 30)                          */
#define CPUSS_SYSTICK_CTL_SKEW_Msk        (0x40000000UL)        /*!< CPUSS SYSTICK_CTL: SKEW (Bitfield-Mask: 0x01)             */
#define CPUSS_SYSTICK_CTL_NOREF_Pos       (31UL)                /*!< CPUSS SYSTICK_CTL: NOREF (Bit 31)                         */
#define CPUSS_SYSTICK_CTL_NOREF_Msk       (0x80000000UL)        /*!< CPUSS SYSTICK_CTL: NOREF (Bitfield-Mask: 0x01)            */
/* ===================================================  CPUSS.MBIST_STAT  ==================================================== */
#define CPUSS_MBIST_STAT_SFP_READY_Pos    (0UL)                 /*!< CPUSS MBIST_STAT: SFP_READY (Bit 0)                       */
#define CPUSS_MBIST_STAT_SFP_READY_Msk    (0x1UL)               /*!< CPUSS MBIST_STAT: SFP_READY (Bitfield-Mask: 0x01)         */
#define CPUSS_MBIST_STAT_SFP_FAIL_Pos     (1UL)                 /*!< CPUSS MBIST_STAT: SFP_FAIL (Bit 1)                        */
#define CPUSS_MBIST_STAT_SFP_FAIL_Msk     (0x2UL)               /*!< CPUSS MBIST_STAT: SFP_FAIL (Bitfield-Mask: 0x01)          */
/* ====================================================  CPUSS.WOUNDING  ===================================================== */
#define CPUSS_WOUNDING_RAM0_WOUND_Pos     (0UL)                 /*!< CPUSS WOUNDING: RAM0_WOUND (Bit 0)                        */
#define CPUSS_WOUNDING_RAM0_WOUND_Msk     (0x7UL)               /*!< CPUSS WOUNDING: RAM0_WOUND (Bitfield-Mask: 0x07)          */
#define CPUSS_WOUNDING_RAM1_WOUND_Pos     (4UL)                 /*!< CPUSS WOUNDING: RAM1_WOUND (Bit 4)                        */
#define CPUSS_WOUNDING_RAM1_WOUND_Msk     (0x70UL)              /*!< CPUSS WOUNDING: RAM1_WOUND (Bitfield-Mask: 0x07)          */
#define CPUSS_WOUNDING_RAM2_WOUND_Pos     (8UL)                 /*!< CPUSS WOUNDING: RAM2_WOUND (Bit 8)                        */
#define CPUSS_WOUNDING_RAM2_WOUND_Msk     (0x700UL)             /*!< CPUSS WOUNDING: RAM2_WOUND (Bitfield-Mask: 0x07)          */
#define CPUSS_WOUNDING_FLASH_WOUND_Pos    (12UL)                /*!< CPUSS WOUNDING: FLASH_WOUND (Bit 12)                      */
#define CPUSS_WOUNDING_FLASH_WOUND_Msk    (0x7000UL)            /*!< CPUSS WOUNDING: FLASH_WOUND (Bitfield-Mask: 0x07)         */
/* ===================================================  CPUSS.PROTECTION  ==================================================== */
#define CPUSS_PROTECTION_STATE_Pos        (0UL)                 /*!< CPUSS PROTECTION: STATE (Bit 0)                           */
#define CPUSS_PROTECTION_STATE_Msk        (0x7UL)               /*!< CPUSS PROTECTION: STATE (Bitfield-Mask: 0x07)             */
/* =================================================  CPUSS.CM0_PC0_HANDLER  ================================================= */
#define CPUSS_CM0_PC0_HANDLER_ADDR_Pos    (0UL)                 /*!< CPUSS CM0_PC0_HANDLER: ADDR (Bit 0)                       */
#define CPUSS_CM0_PC0_HANDLER_ADDR_Msk    (0xffffffffUL)        /*!< CPUSS CM0_PC0_HANDLER: ADDR (Bitfield-Mask: 0xffffffff)   */
/* ==============================================  CPUSS.CM0_VECTOR_TABLE_BASE  ============================================== */
#define CPUSS_CM0_VECTOR_TABLE_BASE_ADDR24_Pos (8UL)            /*!< CPUSS CM0_VECTOR_TABLE_BASE: ADDR24 (Bit 8)               */
#define CPUSS_CM0_VECTOR_TABLE_BASE_ADDR24_Msk (0xffffff00UL)   /*!< CPUSS CM0_VECTOR_TABLE_BASE: ADDR24 (Bitfield-Mask: 0xffffff)*/
/* ==============================================  CPUSS.CM4_VECTOR_TABLE_BASE  ============================================== */
#define CPUSS_CM4_VECTOR_TABLE_BASE_ADDR22_Pos (10UL)           /*!< CPUSS CM4_VECTOR_TABLE_BASE: ADDR22 (Bit 10)              */
#define CPUSS_CM4_VECTOR_TABLE_BASE_ADDR22_Msk (0xfffffc00UL)   /*!< CPUSS CM4_VECTOR_TABLE_BASE: ADDR22 (Bitfield-Mask: 0x3fffff)*/
/* ====================================================  CPUSS.IDENTITY  ===================================================== */
#define CPUSS_IDENTITY_P_Pos              (0UL)                 /*!< CPUSS IDENTITY: P (Bit 0)                                 */
#define CPUSS_IDENTITY_P_Msk              (0x1UL)               /*!< CPUSS IDENTITY: P (Bitfield-Mask: 0x01)                   */
#define CPUSS_IDENTITY_NS_Pos             (1UL)                 /*!< CPUSS IDENTITY: NS (Bit 1)                                */
#define CPUSS_IDENTITY_NS_Msk             (0x2UL)               /*!< CPUSS IDENTITY: NS (Bitfield-Mask: 0x01)                  */
#define CPUSS_IDENTITY_PC_Pos             (4UL)                 /*!< CPUSS IDENTITY: PC (Bit 4)                                */
#define CPUSS_IDENTITY_PC_Msk             (0xf0UL)              /*!< CPUSS IDENTITY: PC (Bitfield-Mask: 0x0f)                  */
#define CPUSS_IDENTITY_MS_Pos             (8UL)                 /*!< CPUSS IDENTITY: MS (Bit 8)                                */
#define CPUSS_IDENTITY_MS_Msk             (0xf00UL)             /*!< CPUSS IDENTITY: MS (Bitfield-Mask: 0x0f)                  */
/* ==================================================  CPUSS.TRIM_ROM_CTL  =================================================== */
#define CPUSS_TRIM_ROM_CTL_RM_Pos         (0UL)                 /*!< CPUSS TRIM_ROM_CTL: RM (Bit 0)                            */
#define CPUSS_TRIM_ROM_CTL_RM_Msk         (0xfUL)               /*!< CPUSS TRIM_ROM_CTL: RM (Bitfield-Mask: 0x0f)              */
#define CPUSS_TRIM_ROM_CTL_RME_Pos        (4UL)                 /*!< CPUSS TRIM_ROM_CTL: RME (Bit 4)                           */
#define CPUSS_TRIM_ROM_CTL_RME_Msk        (0x10UL)              /*!< CPUSS TRIM_ROM_CTL: RME (Bitfield-Mask: 0x01)             */
/* ==================================================  CPUSS.TRIM_RAM_CTL  =================================================== */
#define CPUSS_TRIM_RAM_CTL_RM_Pos         (0UL)                 /*!< CPUSS TRIM_RAM_CTL: RM (Bit 0)                            */
#define CPUSS_TRIM_RAM_CTL_RM_Msk         (0xfUL)               /*!< CPUSS TRIM_RAM_CTL: RM (Bitfield-Mask: 0x0f)              */
#define CPUSS_TRIM_RAM_CTL_RME_Pos        (4UL)                 /*!< CPUSS TRIM_RAM_CTL: RME (Bit 4)                           */
#define CPUSS_TRIM_RAM_CTL_RME_Msk        (0x10UL)              /*!< CPUSS TRIM_RAM_CTL: RME (Bitfield-Mask: 0x01)             */
#define CPUSS_TRIM_RAM_CTL_WPULSE_Pos     (5UL)                 /*!< CPUSS TRIM_RAM_CTL: WPULSE (Bit 5)                        */
#define CPUSS_TRIM_RAM_CTL_WPULSE_Msk     (0xe0UL)              /*!< CPUSS TRIM_RAM_CTL: WPULSE (Bitfield-Mask: 0x07)          */
#define CPUSS_TRIM_RAM_CTL_RA_Pos         (8UL)                 /*!< CPUSS TRIM_RAM_CTL: RA (Bit 8)                            */
#define CPUSS_TRIM_RAM_CTL_RA_Msk         (0x300UL)             /*!< CPUSS TRIM_RAM_CTL: RA (Bitfield-Mask: 0x03)              */
#define CPUSS_TRIM_RAM_CTL_WA_Pos         (12UL)                /*!< CPUSS TRIM_RAM_CTL: WA (Bit 12)                           */
#define CPUSS_TRIM_RAM_CTL_WA_Msk         (0x7000UL)            /*!< CPUSS TRIM_RAM_CTL: WA (Bitfield-Mask: 0x07)              */


#endif /* _CYIP_CPUSS_H_ */


/* [] END OF FILE */
